Problem 1

The accompanying data set contains three numerical variables, x1, x2, and x3.

In [2]:
# load data (remember to upload the datafile you downloaded from connect to colab)
import pandas as pd
myData = pd.read_excel('Ch2_Q9_V19_Data_File.xlsx')
myData

    Observation    x1     x2     x3
0             1  33.0  371.0  189.0
1             2  28.0  752.0    NaN
2             3  24.0  673.0  204.0
3             4  17.0    NaN  151.0
4             5  20.0   66.0  191.0
..          ...   ...    ...    ...
86           87  18.0  412.0  137.0
87           88  28.0  629.0  139.0
88           89  22.0  167.0  125.0
89           90  35.0  842.0  126.0
90           91  38.0  180.0  151.0

[91 rows x 4 columns]

a. How many observations have x1 values greater than 30?

In [3]:
# you can put .count() at the and of your query
myData.query("x1 > 30").count()

Observation    17
x1             17
x2             17
x3             17
dtype: int64

b. Sort the data by x1, x2, and then x3 all in ascending order. What are the x1, x2, and x3 values of the first observation after the data are sorted?

In [9]:
myData.sort_values(['x1','x2','x3'], ascending = True) # observation 44

    Observation    x1     x2     x3
43           44   2.0   46.0  135.0
58           59   4.0  257.0  144.0
40           41   6.0  992.0  150.0
16           17   6.0  999.0  156.0
81           82   7.0  430.0  160.0
..          ...   ...    ...    ...
33           34  39.0  173.0  160.0
45           46  41.0   71.0   94.0
35           36  43.0  768.0  140.0
74           75  55.0  564.0  178.0
20           21   NaN  850.0  162.0

[91 rows x 4 columns]

c. Sort the data by x1 and x2 both in descending order. What are the x1, x2, and x3 values of the first observation after the data are sorted?

In [12]:
myData.sort_values(['x1','x2'], ascending=False)

    Observation    x1     x2     x3
74           75  55.0  564.0  178.0
35           36  43.0  768.0  140.0
45           46  41.0   71.0   94.0
33           34  39.0  173.0  160.0
11           12  39.0   62.0  128.0
..          ...   ...    ...    ...
16           17   6.0  999.0  156.0
40           41   6.0  992.0  150.0
58           59   4.0  257.0  144.0
43           44   2.0   46.0  135.0
20           21   NaN  850.0  162.0

[91 rows x 4 columns]

d. How many missing values are there in x1, x2, and x3?

In [24]:
myData.isna().sum()

Observation    0
x1             1
x2             3
x3             5
dtype: int64

Problem 2.

The following table lists a portion of the average writing and math SAT scores for the 50 states as well as the District of Columbia, Puerto Rico, and the U.S. Virgin Islands for the year 2017 as reported by the College Board.

In [4]:
# Load data
import  pandas as pd
myData1 = pd.read_excel('Ch2_Q11_V10_Data_File.xlsx')

myData1

                   State  Writing  Math
0                Alabama      203   701
1                 Alaska      202   528
2                Arizona      553   625
3               Arkansas      583   509
4             California      524   513
5               Colorado      539   552
6            Connecticut      525   524
7               Delaware      592   583
8   District of Columbia      562   558
9                Florida      573   534
10               Georgia      520   592
11                Hawaii      571   577
12                 Idaho      588   536
13              Illinois      527   550
14               Indiana      599   543
15                  Iowa      600   545
16                Kansas      538   540
17              Kentucky      520   573
18             Louisiana      535   529
19                 Maine      514   593
20              Maryland      552   592
21         Massachusetts      515   556
22              Michigan      566   542
23             Minnesota      586   600
24           Mississippi      599   576
25              Missouri      580   574
26               Montana      512   520
27              Nebraska      588   586
28                Nevada      542   527
29         New Hampshire      537   519
30            New Jersey      520   559
31            New Mexico      549   589
32              New York      571   519
33        North Carolina      560   575
34          North Dakota      553   551
35                  Ohio      518   507
36              Oklahoma      526   502
37                Oregon      577   542
38          Pennsylvania      535   582
39           Puerto Rico      575   567
40          Rhode Island      566   526
41        South Carolina      558   555
42          South Dakota      553   562
43             Tennessee      582   564
44                 Texas      562   522
45                  Utah      517   581
46               Vermont      534   564
47        Virgin Islands      538   561
48              Virginia      547   565
49            Washington      522   502
50         West Virginia      512   569
51             Wisconsin      553   592
52               Wyoming      584   516

a. Sort the data by writing scores in descending order. Which state has the highest average writing score? What is the average math score of that state?

In [7]:
myData1.sort_values('Writing', ascending=False)

                   State  Writing  Math
15                  Iowa      600   545
24           Mississippi      599   576
14               Indiana      599   543
7               Delaware      592   583
12                 Idaho      588   536
27              Nebraska      588   586
23             Minnesota      586   600
52               Wyoming      584   516
3               Arkansas      583   509
43             Tennessee      582   564
25              Missouri      580   574
37                Oregon      577   542
39           Puerto Rico      575   567
9                Florida      573   534
11                Hawaii      571   577
32              New York      571   519
22              Michigan      566   542
40          Rhode Island      566   526
8   District of Columbia      562   558
44                 Texas      562   522
33        North Carolina      560   575
41        South Carolina      558   555
51             Wisconsin      553   592
42          South Dakota      553   562
34          North Dakota      553   551
2                Arizona      553   625
20              Maryland      552   592
31            New Mexico      549   589
48              Virginia      547   565
28                Nevada      542   527
5               Colorado      539   552
47        Virgin Islands      538   561
16                Kansas      538   540
29         New Hampshire      537   519
38          Pennsylvania      535   582
18             Louisiana      535   529
46               Vermont      534   564
13              Illinois      527   550
36              Oklahoma      526   502
6            Connecticut      525   524
4             California      524   513
49            Washington      522   502
10               Georgia      520   592
17              Kentucky      520   573
30            New Jersey      520   559
35                  Ohio      518   507
45                  Utah      517   581
21         Massachusetts      515   556
19                 Maine      514   593
50         West Virginia      512   569
26               Montana      512   520
0                Alabama      203   701
1                 Alaska      202   528

b. Sort the data by math scores in ascending order. Which state has the lowest average math score? What is the average writing score of that state?

In [10]:
myData1.sort_values('Math')

                   State  Writing  Math
49            Washington      522   502
36              Oklahoma      526   502
35                  Ohio      518   507
3               Arkansas      583   509
4             California      524   513
52               Wyoming      584   516
32              New York      571   519
29         New Hampshire      537   519
26               Montana      512   520
44                 Texas      562   522
6            Connecticut      525   524
40          Rhode Island      566   526
28                Nevada      542   527
1                 Alaska      202   528
18             Louisiana      535   529
9                Florida      573   534
12                 Idaho      588   536
16                Kansas      538   540
37                Oregon      577   542
22              Michigan      566   542
14               Indiana      599   543
15                  Iowa      600   545
13              Illinois      527   550
34          North Dakota      553   551
5               Colorado      539   552
41        South Carolina      558   555
21         Massachusetts      515   556
8   District of Columbia      562   558
30            New Jersey      520   559
47        Virgin Islands      538   561
42          South Dakota      553   562
46               Vermont      534   564
43             Tennessee      582   564
48              Virginia      547   565
39           Puerto Rico      575   567
50         West Virginia      512   569
17              Kentucky      520   573
25              Missouri      580   574
33        North Carolina      560   575
24           Mississippi      599   576
11                Hawaii      571   577
45                  Utah      517   581
38          Pennsylvania      535   582
7               Delaware      592   583
27              Nebraska      588   586
31            New Mexico      549   589
20              Maryland      552   592
10               Georgia      520   592
51             Wisconsin      553   592
19                 Maine      514   593
23             Minnesota      586   600
2                Arizona      553   625
0                Alabama      203   701

c. How many states reported an average math score higher than 600?

In [18]:
# remember to put .count() at the end
myData1.query("Math > 600").count()

State      2
Writing    2
Math       2
dtype: int64

d. How many states reported an average writing score lower than 550?

In [21]:
myData1.query("Writing < 550").count()

State      26
Writing    26
Math       26
dtype: int64

Problem 3

Consider the information on annual income (Income in $1,000s), age, sex (F = female, M = male), and marital status (Married; Y = yes, N = no). A portion of the data is shown in the accompanying table.

In [23]:
# Load data
import pandas as pd 

myData2 = pd.read_excel('Ch2_Q14_Data_File.xlsx')
myData2

     Individual  Income  Age Sex Married
0           272     147   55   M       Y
1           364     140   52   M       Y
2           514     140   54   M       N
3           476     138   56   F       Y
4           641     130   45   M       N
..          ...     ...  ...  ..     ...
885         880      32   26   F       N
886         884      32   24   F       Y
887         457      31   26   F       Y
888         402      28   24   F       N
889         694      22   26   F       N

[890 rows x 5 columns]

a. Count the number of males and females in the data.

In [32]:
myData2.query("Sex == 'M'").count()

Individual    508
Income        508
Age           508
Sex           508
Married       508
dtype: int64

In [33]:
myData2.query("Sex == 'F'").count()

Individual    382
Income        382
Age           382
Sex           382
Married       382
dtype: int64

b. What percentage of males and females are married?

In [65]:
# you can count the numerator and the denominator separately and just divide the two numbers
round((myData2.query("Married == 'Y' & Sex == 'M'").count() / 890),2)
# myData2.query("Married == 'Y' & Sex == 'M'").mean()

Individual    0.38
Income        0.38
Age           0.38
Sex           0.38
Married       0.38
dtype: float64

In [52]:
round((myData2.query("Married == 'Y' & Sex == 'F'").count() / 890),2)

Individual    0.28
Income        0.28
Age           0.28
Sex           0.28
Married       0.28
dtype: float64

c. Of the 10 individuals with the highest income, how many are married males?

In [57]:
# Isolate top 10 income individuals and assign it to a new dataset (e.g.: top10_income = ...)
top10_income = myData2.sort_values('Income',ascending=False).head(10)
top10_income

   Individual  Income  Age Sex Married
0         272     147   55   M       Y
2         514     140   54   M       N
1         364     140   52   M       Y
3         476     138   56   F       Y
4         641     130   45   M       N
5         390     129   55   M       Y
6         623     128   53   M       Y
7         626     128   56   M       Y
8         675     126   55   M       Y
9         858     126   52   M       Y

In [59]:
# Subset for married and male from isolated dataset and count  ( put .count() at the end of query)
top10_income.query("Married == 'Y'").count()

Individual    8
Income        8
Age           8
Sex           8
Married       8
dtype: int64

d. What are the highest and the lowest incomes of males and females?

In [87]:
# YOu can create sorted tables and read off the values
top10_income.query("Sex == 'M'")
top10_income.query("Sex == 'F'")

   Individual  Income  Age Sex Married
3         476     138   56   F       Y

In [104]:
myData2.query("Sex == 'F'").tail()

     Individual  Income  Age Sex Married
871         846      41   25   M       Y
873         732      40   24   M       Y
874         180      39   25   M       N
875         379      39   29   M       Y
882         399      35   25   M       Y

In [105]:
myData2.query("Sex == 'M'").tail()

     Individual  Income  Age Sex Married
871         846      41   25   M       Y
873         732      40   24   M       Y
874         180      39   25   M       N
875         379      39   29   M       Y
882         399      35   25   M       Y

e. What are the highest and lowest incomes of married and unmarried males?

In [110]:
marriedMales = myData2.query("Sex == 'M' & Married == 'Y'")
marriedMales.head()
marriedMales.tail()

     Individual  Income  Age Sex Married
866         749      43   26   M       Y
871         846      41   25   M       Y
873         732      40   24   M       Y
875         379      39   29   M       Y
882         399      35   25   M       Y

In [113]:
unmarriedMales = myData2.query("Sex == 'M' & Married == 'N'")
unmarriedMales.head()
unmarriedMales.tail()

     Individual  Income  Age Sex Married
849         801      47   29   M       N
857         490      46   25   M       N
859         523      45   34   M       N
867         220      42   24   M       N
874         180      39   25   M       N